iotest-pmem/fio-output2/libaio-irq-write-4K-1-1-log
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.19
Starting 1 process
test: Laying out IO file (1 file / 10240MiB)

test: (groupid=0, jobs=1): err= 0: pid=470136: Thu Oct 24 14:50:19 2024
  write: IOPS=297k, BW=1159MiB/s (1215MB/s)(67.9GiB/60001msec); 0 zone resets
    slat (nsec): min=1970, max=133169, avg=2408.13, stdev=720.10
    clat (nsec): min=509, max=31340, avg=730.14, stdev=72.19
     lat (nsec): min=2580, max=142529, avg=3188.19, stdev=711.18
    clat percentiles (nsec):
     |  1.00th=[  684],  5.00th=[  692], 10.00th=[  692], 20.00th=[  724],
     | 30.00th=[  732], 40.00th=[  732], 50.00th=[  732], 60.00th=[  732],
     | 70.00th=[  740], 80.00th=[  740], 90.00th=[  740], 95.00th=[  740],
     | 99.00th=[  764], 99.50th=[  844], 99.90th=[ 1208], 99.95th=[ 2608],
     | 99.99th=[ 3632]
   bw (  MiB/s): min=  777, max= 1269, per=100.00%, avg=1160.99, stdev=202.32, samples=119
   iops        : min=199048, max=324916, avg=297213.23, stdev=51794.29, samples=119
  lat (nsec)   : 750=95.57%, 1000=4.26%
  lat (usec)   : 2=0.10%, 4=0.07%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=14.16%, sys=85.65%, ctx=81, majf=0, minf=22
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,17802037,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1159MiB/s (1215MB/s), 1159MiB/s-1159MiB/s (1215MB/s-1215MB/s), io=67.9GiB (72.9GB), run=60001-60001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%