iotest-pmem/fio-output2/libaio-irq-write-4K-1-2-log
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.19
Starting 2 processes
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)

test: (groupid=0, jobs=2): err=28 (file:io_u.c:1803, func=io_u error, error=No space left on device): pid=470243: Thu Oct 24 14:51:23 2024
  write: IOPS=319k, BW=1246MiB/s (1306MB/s)(72.0GiB/60001msec); 0 zone resets
    slat (nsec): min=1910, max=149480, avg=2565.45, stdev=903.14
    clat (nsec): min=520, max=106300, avg=730.36, stdev=76.41
     lat (nsec): min=2550, max=156820, avg=3344.06, stdev=893.60
    clat percentiles (nsec):
     |  1.00th=[  684],  5.00th=[  692], 10.00th=[  692], 20.00th=[  708],
     | 30.00th=[  732], 40.00th=[  732], 50.00th=[  732], 60.00th=[  740],
     | 70.00th=[  740], 80.00th=[  740], 90.00th=[  740], 95.00th=[  748],
     | 99.00th=[  772], 99.50th=[  844], 99.90th=[ 1208], 99.95th=[ 2640],
     | 99.99th=[ 3632]
   bw (  MiB/s): min= 1476, max= 2018, per=100.00%, avg=1897.38, stdev=202.88, samples=133
   iops        : min=378064, max=516624, avg=485729.50, stdev=51936.67, samples=133
  lat (nsec)   : 750=93.33%, 1000=6.49%
  lat (usec)   : 2=0.10%, 4=0.07%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 250=0.01%
  cpu          : usr=13.92%, sys=85.88%, ctx=89, majf=0, minf=53
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19134033,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1246MiB/s (1306MB/s), 1246MiB/s-1246MiB/s (1306MB/s-1306MB/s), io=72.0GiB (78.4GB), run=60001-60001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%