iotest-pmem/fio-output2/libaio-irq-write-4K-1-32-log
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.19
Starting 32 processes
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
[...]

test: (groupid=0, jobs=32): err=28 (file:io_u.c:1803, func=io_u error, error=No space left on device): pid=470734: Thu Oct 24 14:55:36 2024
  write: IOPS=318k, BW=1241MiB/s (1301MB/s)(72.7GiB/60001msec); 0 zone resets
    slat (nsec): min=1909, max=157390, avg=2574.54, stdev=915.03
    clat (nsec): min=509, max=144570, avg=730.64, stdev=84.94
     lat (nsec): min=2580, max=164190, avg=3352.90, stdev=905.96
    clat percentiles (nsec):
     |  1.00th=[  684],  5.00th=[  692], 10.00th=[  700], 20.00th=[  708],
     | 30.00th=[  732], 40.00th=[  732], 50.00th=[  732], 60.00th=[  740],
     | 70.00th=[  740], 80.00th=[  740], 90.00th=[  740], 95.00th=[  748],
     | 99.00th=[  764], 99.50th=[  844], 99.90th=[ 1208], 99.95th=[ 2544],
     | 99.99th=[ 3568]
   bw (  MiB/s): min= 1462, max= 2004, per=100.00%, avg=1884.68, stdev=204.54, samples=133
   iops        : min=374432, max=513264, avg=482477.28, stdev=52362.27, samples=133
  lat (nsec)   : 750=92.52%, 1000=7.31%
  lat (usec)   : 2=0.10%, 4=0.07%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 250=0.01%
  cpu          : usr=13.99%, sys=85.81%, ctx=238, majf=6, minf=735
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19063568,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1241MiB/s (1301MB/s), 1241MiB/s-1241MiB/s (1301MB/s-1301MB/s), io=72.7GiB (78.1GB), run=60001-60001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%