iotest-pmem/fio-output2/libaio-irq-write-4K-1-8-log
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.19
Starting 8 processes
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
[...]

test: (groupid=0, jobs=8): err=28 (file:io_u.c:1803, func=io_u error, error=No space left on device): pid=470503: Thu Oct 24 14:53:29 2024
  write: IOPS=318k, BW=1244MiB/s (1304MB/s)(72.9GiB/60001msec); 0 zone resets
    slat (nsec): min=1890, max=142280, avg=2569.30, stdev=906.17
    clat (nsec): min=510, max=147860, avg=730.95, stdev=93.64
     lat (nsec): min=2530, max=152420, avg=3348.12, stdev=897.62
    clat percentiles (nsec):
     |  1.00th=[  684],  5.00th=[  692], 10.00th=[  692], 20.00th=[  708],
     | 30.00th=[  732], 40.00th=[  732], 50.00th=[  732], 60.00th=[  740],
     | 70.00th=[  740], 80.00th=[  740], 90.00th=[  740], 95.00th=[  748],
     | 99.00th=[  764], 99.50th=[  852], 99.90th=[ 1224], 99.95th=[ 2640],
     | 99.99th=[ 3664]
   bw (  MiB/s): min= 1471, max= 2015, per=100.00%, avg=1893.47, stdev=202.98, samples=133
   iops        : min=376676, max=515886, avg=484727.88, stdev=51963.47, samples=133
  lat (nsec)   : 750=90.94%, 1000=8.87%
  lat (usec)   : 2=0.11%, 4=0.07%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 250=0.01%
  cpu          : usr=13.76%, sys=86.05%, ctx=126, majf=0, minf=199
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19108311,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1244MiB/s (1304MB/s), 1244MiB/s-1244MiB/s (1304MB/s-1304MB/s), io=72.9GiB (78.3GB), run=60001-60001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%